src/mocks/mvno_soap_spec.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sms="http://provider.com/sms">
   <soapenv:Header/>
   <soapenv:Body>
      <sms:ChargeSMS>
         <sms:UserID>abc123</sms:UserID>
         <sms:PhoneNumber>+46701234567</sms:PhoneNumber>
         <sms:MessageID>msg789</sms:MessageID>
         <sms:Timestamp>2025-04-01T12:30:00Z</sms:Timestamp>
         <sms:ChargeAmount>0.05</sms:ChargeAmount>
         <sms:Currency>EUR</sms:Currency>
      </sms:ChargeSMS>
   </soapenv:Body>
</soapenv:Envelope>
